####################################################################################################
Seed: 42
model: fc, embeddings: glove-counterfitted
Layer P1: -1, layer T1: -1
Dataset(s): ['ud-english-lines'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 5,592,368
Trainable params: 5,592,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 600)                     307800      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 30)                  0           
================================================================================
Total params: 3,642,968
Trainable params: 3,642,968
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.004062425684205249
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.6670571428571429, UUAS: 0.37305019305019305, Spearman: 0.7864015850651461
	SDR': 0.40838263358778626, UUAS': 0.14619359076186028, Spearman': 0.7821811762715104
	Δ(SDR): 0.25867450926935665, ΔUUAS: 0.22685660228833276, Δ(Spearman): 0.0042204087936357215
T1: POS-tag.
	Accuracy: 0.6020952380952381 (12.042 words correctly guessed)
	Accuracy': 0.21841603053435116 (4.368 words correctly guessed)
	Δ(Accuracy): 0.38367920756088697 (7.674 drop of words correctly guessed, 7.674 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5523809523809524
	Accuracy': 0.06297709923664122
	Δ(Accuracy): 0.48940385314431123
D1: Depth of the tree.
	SDR: 0.46095238095238095, Spearman: 0.6776547937080438
	SDR': 0.12595419847328243, Spearman': 0.6625437721673353
	Δ(SDR): 0.3349981824790985, Δ(Spearman): 0.015111021540708536




