####################################################################################################
Seed: 42
model: fc, embeddings: word2vec
Layer P1: -1, layer T1: -1
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 5,797,568
Trainable params: 5,797,568
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,437,768
Trainable params: 3,437,768
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.004129392674885399
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.665097972972973, UUAS: 0.28494809688581313, Spearman: 0.768195815037824
	SDR': 0.4738700947225981, UUAS': 0.08998666277842388, Spearman': 0.7597907597265456
	Δ(SDR): 0.1912278782503749, ΔUUAS: 0.19496143410738925, Δ(Spearman): 0.008405055311278331
T1: POS-tag.
	Accuracy: 0.6858108108108109 (13.716 words correctly guessed)
	Accuracy': 0.46820027063599456 (9.364 words correctly guessed)
	Δ(Accuracy): 0.2176105401748163 (4.352 drop of words correctly guessed, 4.352 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6121621621621621
	Accuracy': 0.046008119079837616
	Δ(Accuracy): 0.5661540430823245
D1: Depth of the tree.
	SDR: 0.46621621621621623, Spearman: 0.6947898599714989
	SDR': 0.08119079837618404, Spearman': 0.685216714062866
	Δ(SDR): 0.3850254178400322, Δ(Spearman): 0.009573145908632896




