####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-ewt'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 8,240,348
Trainable params: 8,240,348
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.0673317809899648
	Min cosine similarity: 0.8148532937031339
P1: Structural Probe.
	SDR: 0.8958622448979592, UUAS: 0.675, Spearman: 0.9805604659734478
	SDR': 0.6878527607361964, UUAS': 0.12566675542135666, Spearman': 0.9716697404001485
	Δ(SDR): 0.2080094841617628, ΔUUAS: 0.5493332445786434, Δ(Spearman): 0.008890725573299285
T1: POS-tag.
	Accuracy: 0.6854081632653061 (13.708 words correctly guessed)
	Accuracy': 0.6619631901840491 (13.239 words correctly guessed)
	Δ(Accuracy): 0.023444973081256926 (0.469 drop of words correctly guessed, 0.469 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.9530612244897959
	Accuracy': 0.09611451942740286
	Δ(Accuracy): 0.856946705062393
D1: Depth of the tree.
	SDR: 0.9530612244897959, Spearman: 0.9886935608971363
	SDR': 0.11247443762781185, Spearman': 0.9507303273944636
	Δ(SDR): 0.8405867868619841, Δ(Spearman): 0.03796323350267272




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-ewt'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 8,240,348
Trainable params: 8,240,348
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.07649211585521698
	Min cosine similarity: 0.7733125003447074
P1: Structural Probe.
	SDR: 0.8932091836734694, UUAS: 0.647704081632653, Spearman: 0.9807892053172095
	SDR': 0.6860736196319018, UUAS': 0.1143145496289668, Spearman': 0.9658355465393285
	Δ(SDR): 0.20713556404156752, ΔUUAS: 0.5333895320036862, Δ(Spearman): 0.014953658777881018
T1: POS-tag.
	Accuracy: 0.6872448979591836 (13.745 words correctly guessed)
	Accuracy': 0.6487730061349694 (12.975 words correctly guessed)
	Δ(Accuracy): 0.03847189182421429 (0.769 drop of words correctly guessed, 0.769 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.9571428571428572
	Accuracy': 0.08997955010224949
	Δ(Accuracy): 0.8671633070406077
D1: Depth of the tree.
	SDR: 0.9551020408163265, Spearman: 0.989114884784924
	SDR': 0.08588957055214724, Spearman': 0.9087084390849768
	Δ(SDR): 0.8692124702641792, Δ(Spearman): 0.08040644569994726




