####################################################################################################
Seed: 42
model: fc, embeddings: glove
Layer P1: -1, layer T1: -1
Dataset(s): ['en-universal'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6400)                    3283200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 16)                 0           
================================================================================
Total params: 6,618,368
Trainable params: 6,618,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,437,768
Trainable params: 3,437,768
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.025150250591385696
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.5900244606121425, UUAS: 0.6008427735791289, Spearman: 0.7831272011059701
	SDR': 0.2835244667503137, UUAS': 0.2391500923017766, Spearman': 0.7801382720431768
	Δ(SDR): 0.30649999386182886, ΔUUAS: 0.3616926812773522, Δ(Spearman): 0.002988929062793355
T1: POS-tag.
	Accuracy: 0.8585047666833918 (17.170 words correctly guessed)
	Accuracy': 0.21415307402760353 (4.283 words correctly guessed)
	Δ(Accuracy): 0.6443516926557883 (12.887 drop of words correctly guessed, 12.887 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6869041645760161
	Accuracy': 0.06725219573400251
	Δ(Accuracy): 0.6196519688420136
D1: Depth of the tree.
	SDR: 0.3665328650275966, Spearman: 0.5904311589233343
	SDR': 0.11066499372647427, Spearman': 0.5938733793705151
	Δ(SDR): 0.2558678713011223, Δ(Spearman): -0.0034422204471807882




