####################################################################################################
Seed: 42
model: fc, embeddings: word2vec
Layer P1: -1, layer T1: -1
Dataset(s): ['en-universal'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6400)                    3283200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 16)                 0           
================================================================================
Total params: 6,618,368
Trainable params: 6,618,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,437,768
Trainable params: 3,437,768
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.004085482631899455
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.567544530858003, UUAS: 0.5836650176450683, Spearman: 0.7443575415824768
	SDR': 0.2884002509410289, UUAS': 0.24546653551174663, Spearman': 0.7404361159890375
	Δ(SDR): 0.27914427991697416, ΔUUAS: 0.33819848213332165, Δ(Spearman): 0.003921425593439332
T1: POS-tag.
	Accuracy: 0.7893000501756147 (15.786 words correctly guessed)
	Accuracy': 0.2255708908406524 (4.511 words correctly guessed)
	Δ(Accuracy): 0.5637291593349623 (11.275 drop of words correctly guessed, 11.275 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.7619167084796789
	Accuracy': 0.06825595984943539
	Δ(Accuracy): 0.6936607486302435
D1: Depth of the tree.
	SDR: 0.34345208228800805, Spearman: 0.5370179481321464
	SDR': 0.09811794228356337, Spearman': 0.5310543799186976
	Δ(SDR): 0.2453341400044447, Δ(Spearman): 0.005963568213448789




