####################################################################################################
Seed: 42
model: fc, embeddings: glove-counterfitted
Layer P1: -1, layer T1: -1
Dataset(s): ['en-universal'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6400)                    3283200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 16)                 0           
================================================================================
Total params: 6,618,368
Trainable params: 6,618,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,437,768
Trainable params: 3,437,768
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.0037747736609344104
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.5500702458605118, UUAS: 0.52129493852426, Spearman: 0.7076131404530543
	SDR': 0.29281744040150565, UUAS': 0.241857516811218, Spearman': 0.7055747039606943
	Δ(SDR): 0.25725280545900614, ΔUUAS: 0.279437421713042, Δ(Spearman): 0.0020384364923600184
T1: POS-tag.
	Accuracy: 0.7337556447566482 (14.675 words correctly guessed)
	Accuracy': 0.22523212045169383 (4.505 words correctly guessed)
	Δ(Accuracy): 0.5085235243049544 (10.170 drop of words correctly guessed, 10.170 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6583040642247867
	Accuracy': 0.06825595984943539
	Δ(Accuracy): 0.5900481043753514
D1: Depth of the tree.
	SDR: 0.34295032614149523, Spearman: 0.5640522217826279
	SDR': 0.09887076537013802, Spearman': 0.5616287849603024
	Δ(SDR): 0.24407956077135723, Δ(Spearman): 0.0024234368223254865




