####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-ewt'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 8,240,348
Trainable params: 8,240,348
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.024002979199091595
	Min cosine similarity: 0.978045018172703
P1: Structural Probe.
	SDR: 0.8793163265306122, UUAS: 0.5904336734693878, Spearman: 0.9736112061914834
	SDR': 0.6925664621676891, UUAS': 0.16982564129803393, Spearman': 0.9719556084040576
	Δ(SDR): 0.18674986436292307, ΔUUAS: 0.4206080321713539, Δ(Spearman): 0.0016555977874258554
T1: POS-tag.
	Accuracy: 0.7038775510204082 (14.078 words correctly guessed)
	Accuracy': 0.6467280163599182 (12.935 words correctly guessed)
	Δ(Accuracy): 0.05714953466049 (1.143 drop of words correctly guessed, 1.143 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.9877551020408163
	Accuracy': 0.13701431492842536
	Δ(Accuracy): 0.8507407871123909
D1: Depth of the tree.
	SDR: 0.9918367346938776, Spearman: 0.9971037281106084
	SDR': 0.16768916155419222, Spearman': 0.9887609200552006
	Δ(SDR): 0.8241475731396853, Δ(Spearman): 0.00834280805540788




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-ewt'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 8,240,348
Trainable params: 8,240,348
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.035877677301565804
	Min cosine similarity: 0.9603494214377764
P1: Structural Probe.
	SDR: 0.877545918367347, UUAS: 0.576530612244898, Spearman: 0.9722762399082918
	SDR': 0.6911298568507157, UUAS': 0.16285378022341215, Spearman': 0.9682195109430641
	Δ(SDR): 0.18641606151663126, ΔUUAS: 0.41367683202148586, Δ(Spearman): 0.004056728965227685
T1: POS-tag.
	Accuracy: 0.6726530612244898 (13.453 words correctly guessed)
	Accuracy': 0.6767893660531699 (13.536 words correctly guessed)
	Δ(Accuracy): -0.004136304828680104 (-0.083 drop of words correctly guessed, -0.083 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.9857142857142858
	Accuracy': 0.1390593047034765
	Δ(Accuracy): 0.8466549810108093
D1: Depth of the tree.
	SDR: 0.9795918367346939, Spearman: 0.9939460884829545
	SDR': 0.17177914110429449, Spearman': 0.9782354399674307
	Δ(SDR): 0.8078126956303994, Δ(Spearman): 0.01571064851552384




