####################################################################################################
Seed: 42
model: fc, embeddings: glove-counterfitted
Layer P1: -1, layer T1: -1
Dataset(s): ['ud-english-ewt'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 5,592,368
Trainable params: 5,592,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 3,448,028
Trainable params: 3,448,028
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.003354583384376255
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.8348214285714286, UUAS: 0.2872448979591837, Spearman: 0.8891762747464879
	SDR': 0.7060787321063394, UUAS': 0.11305665193702004, Spearman': 0.8857515902571093
	Δ(SDR): 0.12874269646508918, ΔUUAS: 0.17418824602216365, Δ(Spearman): 0.0034246844893786044
T1: POS-tag.
	Accuracy: 0.8621428571428571 (17.243 words correctly guessed)
	Accuracy': 0.569120654396728 (11.382 words correctly guessed)
	Δ(Accuracy): 0.2930222027461291 (5.860 drop of words correctly guessed, 5.860 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.9530612244897959
	Accuracy': 0.1411042944785276
	Δ(Accuracy): 0.8119569300112683
D1: Depth of the tree.
	SDR: 0.9530612244897959, Spearman: 0.9841385716371316
	SDR': 0.18404907975460122, Spearman': 0.9775126601029355
	Δ(SDR): 0.7690121447351947, Δ(Spearman): 0.006625911534196116




