####################################################################################################
Seed: 42
model: fc, embeddings: word2vec
Layer P1: -1, layer T1: -1
Dataset(s): ['ud-english-lines'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 5,592,368
Trainable params: 5,592,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 600)                     307800      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 30)                  0           
================================================================================
Total params: 3,642,968
Trainable params: 3,642,968
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.00408295636783734
	Min cosine similarity: 0.9067079638418255
P1: Structural Probe.
	SDR: 0.6585380952380953, UUAS: 0.22123552123552123, Spearman: 0.8001562788413754
	SDR': 0.4113645038167939, UUAS': 0.10058363439634413, Spearman': 0.7985035768270855
	Δ(SDR): 0.24717359142130135, ΔUUAS: 0.1206518868391771, Δ(Spearman): 0.0016527020142899085
T1: POS-tag.
	Accuracy: 0.6371428571428571 (12.743 words correctly guessed)
	Accuracy': 0.22356870229007636 (4.471 words correctly guessed)
	Δ(Accuracy): 0.41357415485278076 (8.271 drop of words correctly guessed, 8.271 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6914285714285714
	Accuracy': 0.08969465648854962
	Δ(Accuracy): 0.6017339149400218
D1: Depth of the tree.
	SDR: 0.46095238095238095, Spearman: 0.6799988972463634
	SDR': 0.14694656488549618, Spearman': 0.6805530019983286
	Δ(SDR): 0.31400581606688477, Δ(Spearman): -0.0005541047519651565




