####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 10,589,888
Trainable params: 10,589,888
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.023481922845045727
	Min cosine similarity: 0.9799443176054019
P1: Structural Probe.
	SDR: 0.7109189189189189, UUAS: 0.5635524798154556, Spearman: 0.8166904826476551
	SDR': 0.4674560216508796, UUAS': 0.16481798404751458, Spearman': 0.8158932387541703
	Δ(SDR): 0.24346289726803927, ΔUUAS: 0.39873449576794107, Δ(Spearman): 0.0007972438934847892
T1: POS-tag.
	Accuracy: 0.5838513513513514 (11.677 words correctly guessed)
	Accuracy': 0.6175913396481731 (12.352 words correctly guessed)
	Δ(Accuracy): -0.03373998829682179 (-0.675 drop of words correctly guessed, -0.675 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5878378378378378
	Accuracy': 0.07713125845737483
	Δ(Accuracy): 0.510706579380463
D1: Depth of the tree.
	SDR: 0.48783783783783785, Spearman: 0.7108106599421572
	SDR': 0.13261163734776726, Spearman': 0.7041857483666468
	Δ(SDR): 0.3552262004900706, Δ(Spearman): 0.006624911575510373




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 10,589,888
Trainable params: 10,589,888
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: relu, P1: relu, R1: relu, D1: relu

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.034068986773490906
	Min cosine similarity: 0.9663911789292734
P1: Structural Probe.
	SDR: 0.7125067567567568, UUAS: 0.5516147635524798, Spearman: 0.8291966602713273
	SDR': 0.4627300405953992, UUAS': 0.1562363379356785, Spearman': 0.8274768103897903
	Δ(SDR): 0.2497767161613576, ΔUUAS: 0.39537842561680137, Δ(Spearman): 0.001719849881537061
T1: POS-tag.
	Accuracy: 0.5662837837837837 (11.326 words correctly guessed)
	Accuracy': 0.6742219215155616 (13.484 words correctly guessed)
	Δ(Accuracy): -0.10793813773177785 (-2.159 drop of words correctly guessed, -2.159 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5581081081081081
	Accuracy': 0.07442489851150202
	Δ(Accuracy): 0.48368320959660605
D1: Depth of the tree.
	SDR: 0.4472972972972973, Spearman: 0.6898886591485921
	SDR': 0.10148849797023005, Spearman': 0.6894702102073497
	Δ(SDR): 0.3458087993270672, Δ(Spearman): 0.00041844894124243304




