####################################################################################################
Seed: 42
model: fc, embeddings: word2vec
Layer P1: -1, layer T1: -1
Dataset(s): ['en-universal'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6400)                    3283200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 16)                 0           
================================================================================
Total params: 6,618,368
Trainable params: 6,618,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,437,768
Trainable params: 3,437,768
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.004279616996664431
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.5528255143000502, UUAS: 0.5933416052983548, Spearman: 0.6657380061914847
	SDR': 0.28615746549560855, UUAS': 0.21981143323362207, Spearman': 0.6510955341093554
	Δ(SDR): 0.26666804880444167, ΔUUAS: 0.3735301720647327, Δ(Spearman): 0.01464247208212932
T1: POS-tag.
	Accuracy: 0.7888986452584044 (15.778 words correctly guessed)
	Accuracy': 0.2276913425345044 (4.554 words correctly guessed)
	Δ(Accuracy): 0.5612073027239 (11.224 drop of words correctly guessed, 11.224 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6981936778725539
	Accuracy': 0.053701380175658724
	Δ(Accuracy): 0.6444922976968952
D1: Depth of the tree.
	SDR: 0.30506773707977924, Spearman: 0.46426290043128743
	SDR': 0.07779171894604768, Spearman': 0.458224384411145
	Δ(SDR): 0.22727601813373155, Δ(Spearman): 0.006038516020142437




