####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.028942627211411793
	Min cosine similarity: 0.9735050851648505
P1: Structural Probe.
	SDR: 0.6510655737704918, UUAS: 0.5696875, Spearman: 0.7974003518489137
	SDR': 0.3895041322314049, UUAS': 0.24207937862244086, Spearman': 0.7928647366747826
	Δ(SDR): 0.2615614415390869, ΔUUAS: 0.3276081213775591, Δ(Spearman): 0.004535615174131036
T1: POS-tag.
	Accuracy: 0.6778688524590164 (13.557 words correctly guessed)
	Accuracy': 0.3041322314049587 (6.083 words correctly guessed)
	Δ(Accuracy): 0.3737366210540577 (7.475 drop of words correctly guessed, 7.475 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6639344262295082
	Accuracy': 0.11570247933884298
	Δ(Accuracy): 0.5482319468906651
D1: Depth of the tree.
	SDR: 0.28688524590163933, Spearman: 0.5339056934162637
	SDR': 0.06611570247933884, Spearman': 0.5208647296499321
	Δ(SDR): 0.22076954342230048, Δ(Spearman): 0.01304096376633157




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.04693608979384104
	Min cosine similarity: 0.9314570047638633
P1: Structural Probe.
	SDR: 0.6510655737704918, UUAS: 0.5696875, Spearman: 0.7974003518489137
	SDR': 0.3799173553719008, UUAS': 0.21901379455207207, Spearman': 0.7781850787207232
	Δ(SDR): 0.271148218398591, ΔUUAS: 0.350673705447928, Δ(Spearman): 0.01921527312819049
T1: POS-tag.
	Accuracy: 0.6778688524590164 (13.557 words correctly guessed)
	Accuracy': 0.284297520661157 (5.686 words correctly guessed)
	Δ(Accuracy): 0.3935713317978594 (7.871 drop of words correctly guessed, 1.574 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6639344262295082
	Accuracy': 0.08264462809917356
	Δ(Accuracy): 0.5812897981303347
D1: Depth of the tree.
	SDR: 0.28688524590163933, Spearman: 0.5339056934162637
	SDR': 0.04132231404958678, Spearman': 0.5208501933913797
	Δ(SDR): 0.24556293185205255, Δ(Spearman): 0.013055500024883981




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.05846204857031504
	Min cosine similarity: 0.894478770326977
P1: Structural Probe.
	SDR: 0.6510655737704918, UUAS: 0.5696875, Spearman: 0.7974003518489137
	SDR': 0.3761570247933884, UUAS': 0.20914653528289895, Spearman': 0.7638525703118609
	Δ(SDR): 0.2749085489771034, ΔUUAS: 0.36054096471710106, Δ(Spearman): 0.033547781537052734
T1: POS-tag.
	Accuracy: 0.6778688524590164 (13.557 words correctly guessed)
	Accuracy': 0.28140495867768595 (5.628 words correctly guessed)
	Δ(Accuracy): 0.39646389378133046 (7.929 drop of words correctly guessed, 0.793 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6639344262295082
	Accuracy': 0.0743801652892562
	Δ(Accuracy): 0.589554260940252
D1: Depth of the tree.
	SDR: 0.28688524590163933, Spearman: 0.5339056934162637
	SDR': 0.04132231404958678, Spearman': 0.5335064240338173
	Δ(SDR): 0.24556293185205255, Δ(Spearman): 0.00039926938244638777




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.04254298905531565
	Min cosine similarity: 0.9558144783185534
P1: Structural Probe.
	SDR: 0.6429713114754099, UUAS: 0.5521875, Spearman: 0.7730123572660615
	SDR': 0.3918801652892562, UUAS': 0.24218551915920336, Spearman': 0.7687416870961559
	Δ(SDR): 0.2510911461861537, ΔUUAS: 0.31000198084079666, Δ(Spearman): 0.004270670169905677
T1: POS-tag.
	Accuracy: 0.6684426229508197 (13.369 words correctly guessed)
	Accuracy': 0.30000000000000004 (6.000 words correctly guessed)
	Δ(Accuracy): 0.36844262295081964 (7.369 drop of words correctly guessed, 7.369 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6721311475409836
	Accuracy': 0.08264462809917356
	Δ(Accuracy): 0.58948651944181
D1: Depth of the tree.
	SDR: 0.2786885245901639, Spearman: 0.5102023965507246
	SDR': 0.049586776859504134, Spearman': 0.5131417395839466
	Δ(SDR): 0.22910174773065978, Δ(Spearman): -0.002939343033221964




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.06125133236249288
	Min cosine similarity: 0.9108123429550612
P1: Structural Probe.
	SDR: 0.6429713114754099, UUAS: 0.5521875, Spearman: 0.7730123572660615
	SDR': 0.38123966942148757, UUAS': 0.22189380927419206, Spearman': 0.7605749025905134
	Δ(SDR): 0.2617316420539223, ΔUUAS: 0.330293690725808, Δ(Spearman): 0.012437454675548132
T1: POS-tag.
	Accuracy: 0.6684426229508197 (13.369 words correctly guessed)
	Accuracy': 0.28471074380165284 (5.694 words correctly guessed)
	Δ(Accuracy): 0.38373187914916684 (7.675 drop of words correctly guessed, 1.535 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6721311475409836
	Accuracy': 0.05785123966942149
	Δ(Accuracy): 0.6142799078715621
D1: Depth of the tree.
	SDR: 0.2786885245901639, Spearman: 0.5102023965507246
	SDR': 0.01652892561983471, Spearman': 0.5036376502684544
	Δ(SDR): 0.2621595989703292, Δ(Spearman): 0.006564746282270217




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.07221050560474396
	Min cosine similarity: 0.8786636630365671
P1: Structural Probe.
	SDR: 0.6429713114754099, UUAS: 0.5521875, Spearman: 0.7730123572660615
	SDR': 0.37599173553719006, UUAS': 0.2073688671774796, Spearman': 0.7544326723084743
	Δ(SDR): 0.2669795759382198, ΔUUAS: 0.34481863282252045, Δ(Spearman): 0.018579684957587217
T1: POS-tag.
	Accuracy: 0.6684426229508197 (13.369 words correctly guessed)
	Accuracy': 0.27561983471074375 (5.512 words correctly guessed)
	Δ(Accuracy): 0.39282278824007594 (7.856 drop of words correctly guessed, 0.786 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6721311475409836
	Accuracy': 0.049586776859504134
	Δ(Accuracy): 0.6225443706814795
D1: Depth of the tree.
	SDR: 0.2786885245901639, Spearman: 0.5102023965507246
	SDR': 0.03305785123966942, Spearman': 0.47801375171712535
	Δ(SDR): 0.2456306733504945, Δ(Spearman): 0.03218864483359929




