####################################################################################################
Seed: 42
model: fc, embeddings: word2vec
Layer P1: -1, layer T1: -1
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 6,413,168
Trainable params: 6,413,168
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 3,427,508
Trainable params: 3,427,508
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.004248985716894701
	Min cosine similarity: 0.9172935578754798
P1: Structural Probe.
	SDR: 0.5966188524590164, UUAS: 0.4446875, Spearman: 0.6365688168874337
	SDR': 0.3946900826446282, UUAS': 0.33339012130878154, Spearman': 0.6466909961742028
	Δ(SDR): 0.20192876981438818, ΔUUAS: 0.11129737869121847, Δ(Spearman): -0.010122179286769062
T1: POS-tag.
	Accuracy: 0.6618852459016393 (13.238 words correctly guessed)
	Accuracy': 0.34586776859504126 (6.917 words correctly guessed)
	Δ(Accuracy): 0.31601747730659807 (6.320 drop of words correctly guessed, 6.320 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.7459016393442623
	Accuracy': 0.1322314049586777
	Δ(Accuracy): 0.6136702343855847
D1: Depth of the tree.
	SDR: 0.27049180327868855, Spearman: 0.5832515665368456
	SDR': 0.09090909090909091, Spearman': 0.5831134020907341
	Δ(SDR): 0.17958271236959764, Δ(Spearman): 0.00013816444611147727




