####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -9, layer T1: -9
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.05230176945527395
	Min cosine similarity: 0.8932365627328226
P1: Structural Probe.
	SDR: 0.6530122950819672, UUAS: 0.586875, Spearman: 0.7933396590163595
	SDR': 0.384896694214876, UUAS': 0.24293974898041884, Spearman': 0.7900060736729234
	Δ(SDR): 0.26811560086709124, ΔUUAS: 0.3439352510195812, Δ(Spearman): 0.003333585343436085
T1: POS-tag.
	Accuracy: 0.6721311475409836 (13.443 words correctly guessed)
	Accuracy': 0.3004132231404959 (6.008 words correctly guessed)
	Δ(Accuracy): 0.3717179244004877 (7.434 drop of words correctly guessed, 7.434 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6885245901639344
	Accuracy': 0.1487603305785124
	Δ(Accuracy): 0.539764259585422
D1: Depth of the tree.
	SDR: 0.3114754098360656, Spearman: 0.5901107776655821
	SDR': 0.06611570247933884, Spearman': 0.5599629367532512
	Δ(SDR): 0.24535970735672674, Δ(Spearman): 0.030147840912330914




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -9, layer T1: -9
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.08265077571074168
	Min cosine similarity: 0.7428030888896343
P1: Structural Probe.
	SDR: 0.6530122950819672, UUAS: 0.586875, Spearman: 0.7933396590163595
	SDR': 0.37547520661157024, UUAS': 0.22491328448266248, Spearman': 0.7843173396367137
	Δ(SDR): 0.277537088470397, ΔUUAS: 0.3619617155173376, Δ(Spearman): 0.009022319379645816
T1: POS-tag.
	Accuracy: 0.6721311475409836 (13.443 words correctly guessed)
	Accuracy': 0.27892561983471076 (5.579 words correctly guessed)
	Δ(Accuracy): 0.3932055277062728 (7.864 drop of words correctly guessed, 1.573 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6885245901639344
	Accuracy': 0.09090909090909091
	Δ(Accuracy): 0.5976154992548435
D1: Depth of the tree.
	SDR: 0.3114754098360656, Spearman: 0.5901107776655821
	SDR': 0.024793388429752067, Spearman': 0.5411095757180516
	Δ(SDR): 0.2866820214063135, Δ(Spearman): 0.04900120194753044




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -9, layer T1: -9
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.10406344135602315
	Min cosine similarity: 0.5977814544823544
P1: Structural Probe.
	SDR: 0.6530122950819672, UUAS: 0.586875, Spearman: 0.7933396590163595
	SDR': 0.36958677685950414, UUAS': 0.21547634980649333, Spearman': 0.7788342559559799
	Δ(SDR): 0.2834255182224631, ΔUUAS: 0.3713986501935067, Δ(Spearman): 0.014505403060379618
T1: POS-tag.
	Accuracy: 0.6721311475409836 (13.443 words correctly guessed)
	Accuracy': 0.2731404958677686 (5.463 words correctly guessed)
	Δ(Accuracy): 0.39899065167321496 (7.980 drop of words correctly guessed, 0.798 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6885245901639344
	Accuracy': 0.06611570247933884
	Δ(Accuracy): 0.6224088876845956
D1: Depth of the tree.
	SDR: 0.3114754098360656, Spearman: 0.5901107776655821
	SDR': 0.01652892561983471, Spearman': 0.5144064137358716
	Δ(SDR): 0.2949464842162309, Δ(Spearman): 0.07570436392971047




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -5, layer T1: -5
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.05966339508692423
	Min cosine similarity: 0.8667102670373995
P1: Structural Probe.
	SDR: 0.651577868852459, UUAS: 0.565, Spearman: 0.7677521111368709
	SDR': 0.38814049586776855, UUAS': 0.22514815062661953, Spearman': 0.7630601696415398
	Δ(SDR): 0.2634373729846905, ΔUUAS: 0.3398518493733804, Δ(Spearman): 0.004691941495331142
T1: POS-tag.
	Accuracy: 0.6323770491803279 (12.648 words correctly guessed)
	Accuracy': 0.2801652892561984 (5.603 words correctly guessed)
	Δ(Accuracy): 0.3522117599241295 (7.044 drop of words correctly guessed, 7.044 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6885245901639344
	Accuracy': 0.10743801652892562
	Δ(Accuracy): 0.5810865736350088
D1: Depth of the tree.
	SDR: 0.3360655737704918, Spearman: 0.6626018509918612
	SDR': 0.03305785123966942, Spearman': 0.6015677535124657
	Δ(SDR): 0.30300772253082237, Δ(Spearman): 0.06103409747939548




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -5, layer T1: -5
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.08837634325027466
	Min cosine similarity: 0.7237880099410853
P1: Structural Probe.
	SDR: 0.651577868852459, UUAS: 0.565, Spearman: 0.7677521111368709
	SDR': 0.37030991735537194, UUAS': 0.20960604387637882, Spearman': 0.7499898593704223
	Δ(SDR): 0.2812679514970871, ΔUUAS: 0.3553939561236211, Δ(Spearman): 0.017762251766448633
T1: POS-tag.
	Accuracy: 0.6323770491803279 (12.648 words correctly guessed)
	Accuracy': 0.2557851239669422 (5.116 words correctly guessed)
	Δ(Accuracy): 0.3765919252133857 (7.532 drop of words correctly guessed, 1.506 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6885245901639344
	Accuracy': 0.05785123966942149
	Δ(Accuracy): 0.6306733504945129
D1: Depth of the tree.
	SDR: 0.3360655737704918, Spearman: 0.6626018509918612
	SDR': 0.01652892561983471, Spearman': 0.5448840031390033
	Δ(SDR): 0.3195366481506571, Δ(Spearman): 0.11771784785285788




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -5, layer T1: -5
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 11,205,488
Trainable params: 11,205,488
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 8,219,828
Trainable params: 8,219,828
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.10624211033185323
	Min cosine similarity: 0.6163672179229989
P1: Structural Probe.
	SDR: 0.651577868852459, UUAS: 0.565, Spearman: 0.7677521111368709
	SDR': 0.36109504132231407, UUAS': 0.19557402326541085, Spearman': 0.7299894281390776
	Δ(SDR): 0.290482827530145, ΔUUAS: 0.3694259767345891, Δ(Spearman): 0.037762682997793284
T1: POS-tag.
	Accuracy: 0.6323770491803279 (12.648 words correctly guessed)
	Accuracy': 0.23512396694214877 (4.702 words correctly guessed)
	Δ(Accuracy): 0.3972530822381791 (7.945 drop of words correctly guessed, 0.795 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6885245901639344
	Accuracy': 0.04132231404958678
	Δ(Accuracy): 0.6472022761143477
D1: Depth of the tree.
	SDR: 0.3360655737704918, Spearman: 0.6626018509918612
	SDR': 0.008264462809917356, Spearman': 0.48671832220802796
	Δ(SDR): 0.3278011109605744, Δ(Spearman): 0.17588352878383323




