####################################################################################################
Seed: 42
model: fc, embeddings: glove-counterfitted
Layer P1: -1, layer T1: -1
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 5,797,568
Trainable params: 5,797,568
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,437,768
Trainable params: 3,437,768
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.004006811385332038
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.6637905405405405, UUAS: 0.4781430219146482, Spearman: 0.6594622890547502
	SDR': 0.48273342354533155, UUAS': 0.1308096141820487, Spearman': 0.6572027531474935
	Δ(SDR): 0.181057116995209, ΔUUAS: 0.34733340773259946, Δ(Spearman): 0.0022595359072566934
T1: POS-tag.
	Accuracy: 0.6504054054054054 (13.008 words correctly guessed)
	Accuracy': 0.4769959404600812 (9.540 words correctly guessed)
	Δ(Accuracy): 0.17340946494532417 (3.468 drop of words correctly guessed, 3.468 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.4689189189189189
	Accuracy': 0.058186738836265225
	Δ(Accuracy): 0.41073218008265366
D1: Depth of the tree.
	SDR: 0.422972972972973, Spearman: 0.5826176230585368
	SDR': 0.08795669824086604, Spearman': 0.5830274173885285
	Δ(SDR): 0.33501627473210693, Δ(Spearman): -0.000409794329991664




