####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-ewt'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 8,240,348
Trainable params: 8,240,348
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.034192293882369995
	Min cosine similarity: 0.9619047712450866
P1: Structural Probe.
	SDR: 0.9528673469387755, UUAS: 0.8383928571428572, Spearman: 0.9910714225768281
	SDR': 0.685178936605317, UUAS': 0.12985403457029224, Spearman': 0.9777311078612172
	Δ(SDR): 0.26768841033345847, ΔUUAS: 0.708538822572565, Δ(Spearman): 0.013340314715610924
T1: POS-tag.
	Accuracy: 0.9727551020408163 (19.455 words correctly guessed)
	Accuracy': 0.5326175869120654 (10.652 words correctly guessed)
	Δ(Accuracy): 0.4401375151287509 (8.803 drop of words correctly guessed, 8.803 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.9877551020408163
	Accuracy': 0.08384458077709611
	Δ(Accuracy): 0.9039105212637202
D1: Depth of the tree.
	SDR: 0.9877551020408163, Spearman: 0.9962586229684861
	SDR': 0.12065439672801637, Spearman': 0.9380300275484048
	Δ(SDR): 0.8671007053127999, Δ(Spearman): 0.0582285954200813




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-ewt'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 8,240,348
Trainable params: 8,240,348
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.051653588811556496
	Min cosine similarity: 0.915819482813096
P1: Structural Probe.
	SDR: 0.9528673469387755, UUAS: 0.8383928571428572, Spearman: 0.9910714225768281
	SDR': 0.6778629856850716, UUAS': 0.09480053433274292, Spearman': 0.9469601861303087
	Δ(SDR): 0.27500436125370387, ΔUUAS: 0.7435923228101142, Δ(Spearman): 0.044111236446519375
T1: POS-tag.
	Accuracy: 0.9727551020408163 (19.455 words correctly guessed)
	Accuracy': 0.5261758691206543 (10.524 words correctly guessed)
	Δ(Accuracy): 0.446579232920162 (8.932 drop of words correctly guessed, 1.786 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.9877551020408163
	Accuracy': 0.04703476482617587
	Δ(Accuracy): 0.9407203372146404
D1: Depth of the tree.
	SDR: 0.9877551020408163, Spearman: 0.9962586229684861
	SDR': 0.06748466257668712, Spearman': 0.8371840328271232
	Δ(SDR): 0.9202704394641292, Δ(Spearman): 0.15907459014136294




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-ewt'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 8,240,348
Trainable params: 8,240,348
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.05920964479446411
	Min cosine similarity: 0.8902098643755376
P1: Structural Probe.
	SDR: 0.9528673469387755, UUAS: 0.8383928571428572, Spearman: 0.9910714225768281
	SDR': 0.6758588957055215, UUAS': 0.09055937671735217, Spearman': 0.9121989703746501
	Δ(SDR): 0.277008451233254, ΔUUAS: 0.747833480425505, Δ(Spearman): 0.07887245220217798
T1: POS-tag.
	Accuracy: 0.9727551020408163 (19.455 words correctly guessed)
	Accuracy': 0.5275051124744377 (10.550 words correctly guessed)
	Δ(Accuracy): 0.4452499895663786 (8.905 drop of words correctly guessed, 0.890 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.9877551020408163
	Accuracy': 0.034764826175869123
	Δ(Accuracy): 0.9529902758649471
D1: Depth of the tree.
	SDR: 0.9877551020408163, Spearman: 0.9962586229684861
	SDR': 0.065439672801636, Spearman': 0.7198494463865368
	Δ(SDR): 0.9223154292391803, Δ(Spearman): 0.2764091765819493




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-ewt'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 8,240,348
Trainable params: 8,240,348
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: BERT-no coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.05189158022403717
	Min cosine similarity: 0.9295111257118194
P1: Structural Probe.
	SDR: 0.9497602040816326, UUAS: 0.8253826530612245, Spearman: 0.9877547054245617
	SDR': 0.6844069529652351, UUAS': 0.1294467050218584, Spearman': 0.9714374950338819
	Δ(SDR): 0.2653532511163975, ΔUUAS: 0.6959359480393661, Δ(Spearman): 0.016317210390679793
T1: POS-tag.
	Accuracy: 0.9628571428571429 (19.257 words correctly guessed)
	Accuracy': 0.5321063394683027 (10.642 words correctly guessed)
	Δ(Accuracy): 0.4307508033888402 (8.615 drop of words correctly guessed, 8.615 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.9673469387755103
	Accuracy': 0.081799591002045
	Δ(Accuracy): 0.8855473477734652
D1: Depth of the tree.
	SDR: 0.9408163265306122, Spearman: 0.9875517212420769
	SDR': 0.09815950920245399, Spearman': 0.9203244498031555
	Δ(SDR): 0.8426568173281582, Δ(Spearman): 0.06722727143892138




