####################################################################################################
Seed: 42
model: fc, embeddings: glove
Layer P1: -1, layer T1: -1
Dataset(s): ['en-universal'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6400)                    3283200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 16)                 0           
================================================================================
Total params: 6,618,368
Trainable params: 6,618,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,437,768
Trainable params: 3,437,768
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.025150250591385696
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.5759639989964878, UUAS: 0.5969109044910325, Spearman: 0.7204934497868809
	SDR': 0.2873042659974906, UUAS': 0.2308619642111092, Spearman': 0.7156816412150119
	Δ(SDR): 0.28865973299899716, ΔUUAS: 0.3660489402799233, Δ(Spearman): 0.004811808571869025
T1: POS-tag.
	Accuracy: 0.8543527345709985 (17.087 words correctly guessed)
	Accuracy': 0.21944792973651192 (4.389 words correctly guessed)
	Δ(Accuracy): 0.6349048048344865 (12.698 drop of words correctly guessed, 12.698 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6176618163572504
	Accuracy': 0.06198243412797993
	Δ(Accuracy): 0.5556793822292705
D1: Depth of the tree.
	SDR: 0.3278976417461114, Spearman: 0.5394600759576019
	SDR': 0.09084065244667504, Spearman': 0.5363405644775855
	Δ(SDR): 0.23705698929943636, Δ(Spearman): 0.0031195114800164347




####################################################################################################
Seed: 42
model: fc, embeddings: glove
Layer P1: -1, layer T1: -1
Dataset(s): ['en-universal'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6400)                    3283200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 16)                 0           
================================================================================
Total params: 6,618,368
Trainable params: 6,618,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,437,768
Trainable params: 3,437,768
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.03751192115882805
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.5759639989964878, UUAS: 0.5969109044910325, Spearman: 0.7204934497868809
	SDR': 0.27529924717691345, UUAS': 0.21357519230321553, Spearman': 0.7073769513795307
	Δ(SDR): 0.3006647518195743, ΔUUAS: 0.3833357121878169, Δ(Spearman): 0.013116498407350186
T1: POS-tag.
	Accuracy: 0.8543527345709985 (17.087 words correctly guessed)
	Accuracy': 0.20637390213299878 (4.127 words correctly guessed)
	Δ(Accuracy): 0.6479788324379997 (12.960 drop of words correctly guessed, 2.592 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6176618163572504
	Accuracy': 0.04165621079046424
	Δ(Accuracy): 0.5760056055667861
D1: Depth of the tree.
	SDR: 0.3278976417461114, Spearman: 0.5394600759576019
	SDR': 0.05545796737766625, Spearman': 0.5271002658205415
	Δ(SDR): 0.2724396743684452, Δ(Spearman): 0.012359810137060445




####################################################################################################
Seed: 42
model: fc, embeddings: glove
Layer P1: -1, layer T1: -1
Dataset(s): ['en-universal'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6400)                    3283200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 16)                 0           
================================================================================
Total params: 6,618,368
Trainable params: 6,618,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,437,768
Trainable params: 3,437,768
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.04678523541350197
	Min cosine similarity: nan
P1: Structural Probe.
	SDR: 0.5759639989964878, UUAS: 0.5969109044910325, Spearman: 0.7204934497868809
	SDR': 0.2694811794228356, UUAS': 0.20520970161604446, Spearman': 0.69802126720216
	Δ(SDR): 0.30648281957365214, ΔUUAS: 0.391701202874988, Δ(Spearman): 0.022472182584720946
T1: POS-tag.
	Accuracy: 0.8543527345709985 (17.087 words correctly guessed)
	Accuracy': 0.19938519447929737 (3.988 words correctly guessed)
	Δ(Accuracy): 0.6549675400917011 (13.099 drop of words correctly guessed, 1.310 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.6176618163572504
	Accuracy': 0.031869510664993723
	Δ(Accuracy): 0.5857923056922566
D1: Depth of the tree.
	SDR: 0.3278976417461114, Spearman: 0.5394600759576019
	SDR': 0.0424090338770389, Spearman': 0.5150959266428735
	Δ(SDR): 0.2854886078690725, Δ(Spearman): 0.02436414931472841




