####################################################################################################
Seed: 42
model: fc, embeddings: word2vec
Layer P1: -1, layer T1: -1
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 6,413,168
Trainable params: 6,413,168
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 3,427,508
Trainable params: 3,427,508
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.0039521333828340345
	Min cosine similarity: 0.9259756101599905
P1: Structural Probe.
	SDR: 0.5966188524590164, UUAS: 0.4446875, Spearman: 0.6365688168874337
	SDR': 0.41834710743801645, UUAS': 0.3395327028102148, Spearman': 0.6374899640875726
	Δ(SDR): 0.1782717450209999, ΔUUAS: 0.10515479718978521, Δ(Spearman): -0.0009211472001389165
T1: POS-tag.
	Accuracy: 0.6618852459016393 (13.238 words correctly guessed)
	Accuracy': 0.3768595041322314 (7.537 words correctly guessed)
	Δ(Accuracy): 0.2850257417694079 (5.701 drop of words correctly guessed, 5.701 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.7459016393442623
	Accuracy': 0.12396694214876033
	Δ(Accuracy): 0.621934697195502
D1: Depth of the tree.
	SDR: 0.27049180327868855, Spearman: 0.5832515665368456
	SDR': 0.1322314049586777, Spearman': 0.586196623666573
	Δ(SDR): 0.13826039832001086, Δ(Spearman): -0.0029450571297273687




####################################################################################################
Seed: 42
model: fc, embeddings: word2vec
Layer P1: -1, layer T1: -1
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 6,413,168
Trainable params: 6,413,168
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 3,427,508
Trainable params: 3,427,508
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.005806736177024121
	Min cosine similarity: 0.8441827400375203
P1: Structural Probe.
	SDR: 0.5966188524590164, UUAS: 0.4446875, Spearman: 0.6365688168874337
	SDR': 0.4014876033057851, UUAS': 0.33507447496681947, Spearman': 0.6357370242907728
	Δ(SDR): 0.19513124915323127, ΔUUAS: 0.10961302503318054, Δ(Spearman): 0.0008317925966608852
T1: POS-tag.
	Accuracy: 0.6618852459016393 (13.238 words correctly guessed)
	Accuracy': 0.35206611570247937 (7.041 words correctly guessed)
	Δ(Accuracy): 0.30981913019915996 (6.196 drop of words correctly guessed, 1.239 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.7459016393442623
	Accuracy': 0.11570247933884298
	Δ(Accuracy): 0.6301991600054193
D1: Depth of the tree.
	SDR: 0.27049180327868855, Spearman: 0.5832515665368456
	SDR': 0.09917355371900827, Spearman': 0.5839541472413498
	Δ(SDR): 0.17131824955968028, Δ(Spearman): -0.0007025807045041299




####################################################################################################
Seed: 42
model: fc, embeddings: word2vec
Layer P1: -1, layer T1: -1
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 6,413,168
Trainable params: 6,413,168
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 3,427,508
Trainable params: 3,427,508
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.007090646862067495
	Min cosine similarity: 0.7764548834756062
P1: Structural Probe.
	SDR: 0.5966188524590164, UUAS: 0.4446875, Spearman: 0.6365688168874337
	SDR': 0.3973553719008264, UUAS': 0.33390548845094303, Spearman': 0.6340490237015635
	Δ(SDR): 0.19926348055818993, ΔUUAS: 0.11078201154905698, Δ(Spearman): 0.002519793185870256
T1: POS-tag.
	Accuracy: 0.6618852459016393 (13.238 words correctly guessed)
	Accuracy': 0.34710743801652894 (6.942 words correctly guessed)
	Δ(Accuracy): 0.3147778078851104 (6.296 drop of words correctly guessed, 0.630 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.7459016393442623
	Accuracy': 0.11570247933884298
	Δ(Accuracy): 0.6301991600054193
D1: Depth of the tree.
	SDR: 0.27049180327868855, Spearman: 0.5832515665368456
	SDR': 0.11570247933884298, Spearman': 0.5678443297039212
	Δ(SDR): 0.15478932393984557, Δ(Spearman): 0.015407236832924442




