####################################################################################################
Seed: 42
model: fc, embeddings: glove-counterfitted
Layer P1: -1, layer T1: -1
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 6,413,168
Trainable params: 6,413,168
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 3,427,508
Trainable params: 3,427,508
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.0035838543197526684
	Min cosine similarity: 0.9295749268162655
P1: Structural Probe.
	SDR: 0.5957377049180328, UUAS: 0.4253125, Spearman: 0.619550646593992
	SDR': 0.428698347107438, UUAS': 0.3380200607473335, Spearman': 0.6183773284386023
	Δ(SDR): 0.1670393578105948, ΔUUAS: 0.0872924392526665, Δ(Spearman): 0.0011733181553896799
T1: POS-tag.
	Accuracy: 0.6090163934426229 (12.180 words correctly guessed)
	Accuracy': 0.38553719008264464 (7.711 words correctly guessed)
	Δ(Accuracy): 0.22347920335997828 (4.470 drop of words correctly guessed, 4.470 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5819672131147541
	Accuracy': 0.2066115702479339
	Δ(Accuracy): 0.3753556428668202
D1: Depth of the tree.
	SDR: 0.19672131147540983, Spearman: 0.5715947060542153
	SDR': 0.12396694214876033, Spearman': 0.5550698980410933
	Δ(SDR): 0.0727543693266495, Δ(Spearman): 0.01652480801312195




####################################################################################################
Seed: 42
model: fc, embeddings: glove-counterfitted
Layer P1: -1, layer T1: -1
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 6,413,168
Trainable params: 6,413,168
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 3,427,508
Trainable params: 3,427,508
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.005385718124490596
	Min cosine similarity: 0.8535998036415471
P1: Structural Probe.
	SDR: 0.5957377049180328, UUAS: 0.4253125, Spearman: 0.619550646593992
	SDR': 0.4186776859504132, UUAS': 0.33464995929110763, Spearman': 0.6150885992179964
	Δ(SDR): 0.17706001896761958, ΔUUAS: 0.09066254070889235, Δ(Spearman): 0.004462047375995537
T1: POS-tag.
	Accuracy: 0.6090163934426229 (12.180 words correctly guessed)
	Accuracy': 0.37024793388429755 (7.405 words correctly guessed)
	Δ(Accuracy): 0.23876845955832537 (4.775 drop of words correctly guessed, 0.955 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5819672131147541
	Accuracy': 0.1652892561983471
	Δ(Accuracy): 0.41667795691640697
D1: Depth of the tree.
	SDR: 0.19672131147540983, Spearman: 0.5715947060542153
	SDR': 0.0743801652892562, Spearman': 0.5424435982855336
	Δ(SDR): 0.12234114618615363, Δ(Spearman): 0.029151107768681683




####################################################################################################
Seed: 42
model: fc, embeddings: glove-counterfitted
Layer P1: -1, layer T1: -1
Dataset(s): ['ted'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 6000)                    3078000     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 15)                 0           
================================================================================
Total params: 6,413,168
Trainable params: 6,413,168
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 9)                   0           
================================================================================
Total params: 3,427,508
Trainable params: 3,427,508
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.0065709872434910055
	Min cosine similarity: 0.7903599379404902
P1: Structural Probe.
	SDR: 0.5957377049180328, UUAS: 0.4253125, Spearman: 0.619550646593992
	SDR': 0.4166942148760331, UUAS': 0.3321400423075064, Spearman': 0.6182448323920701
	Δ(SDR): 0.1790434900419997, ΔUUAS: 0.0931724576924936, Δ(Spearman): 0.0013058142019218844
T1: POS-tag.
	Accuracy: 0.6090163934426229 (12.180 words correctly guessed)
	Accuracy': 0.36735537190082646 (7.347 words correctly guessed)
	Δ(Accuracy): 0.24166102154179647 (4.833 drop of words correctly guessed, 0.483 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5819672131147541
	Accuracy': 0.1487603305785124
	Δ(Accuracy): 0.4332068825362417
D1: Depth of the tree.
	SDR: 0.19672131147540983, Spearman: 0.5715947060542153
	SDR': 0.06611570247933884, Spearman': 0.5377211390283101
	Δ(SDR): 0.130605608996071, Δ(Spearman): 0.03387356702590516




