####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.021122395992279053
	Min cosine similarity: 0.9846888792635214
P1: Structural Probe.
	SDR: 0.51555, UUAS: 0.5097205346294046, Spearman: 0.6577701708911813
	SDR': 0.36489898989898983, UUAS': 0.23188393661409426, Spearman': 0.657503605486334
	Δ(SDR): 0.15065101010101012, ΔUUAS: 0.27783659801531035, Δ(Spearman): 0.0002665654048472632
T1: POS-tag.
	Accuracy: 0.487 (9.740 words correctly guessed)
	Accuracy': 0.16464646464646462 (3.293 words correctly guessed)
	Δ(Accuracy): 0.3223535353535354 (6.447 drop of words correctly guessed, 6.447 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.05
	Accuracy': 0.0
	Δ(Accuracy): 0.05
D1: Depth of the tree.
	SDR: 0.22, Spearman: 0.3957351694679958
	SDR': 0.18181818181818182, Spearman': 0.39455139990379107
	Δ(SDR): 0.03818181818181818, Δ(Spearman): 0.0011837695642047397




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.031778447329998016
	Min cosine similarity: 0.9684402087722161
P1: Structural Probe.
	SDR: 0.51555, UUAS: 0.5097205346294046, Spearman: 0.6577701708911813
	SDR': 0.35611111111111104, UUAS': 0.21731246045792443, Spearman': 0.6596030122734902
	Δ(SDR): 0.1594388888888889, ΔUUAS: 0.2924080741714802, Δ(Spearman): -0.0018328413823088807
T1: POS-tag.
	Accuracy: 0.487 (9.740 words correctly guessed)
	Accuracy': 0.14595959595959598 (2.919 words correctly guessed)
	Δ(Accuracy): 0.34104040404040403 (6.821 drop of words correctly guessed, 1.364 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.05
	Accuracy': 0.0
	Δ(Accuracy): 0.05
D1: Depth of the tree.
	SDR: 0.22, Spearman: 0.3957351694679958
	SDR': 0.18181818181818182, Spearman': 0.39455139990379107
	Δ(SDR): 0.03818181818181818, Δ(Spearman): 0.0011837695642047397




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.038119569420814514
	Min cosine similarity: 0.9546112893807768
P1: Structural Probe.
	SDR: 0.51555, UUAS: 0.5097205346294046, Spearman: 0.6577701708911813
	SDR': 0.34964646464646465, UUAS': 0.21268211792064878, Spearman': 0.6591823781186094
	Δ(SDR): 0.1659035353535353, ΔUUAS: 0.2970384167087558, Δ(Spearman): -0.001412207227428075
T1: POS-tag.
	Accuracy: 0.487 (9.740 words correctly guessed)
	Accuracy': 0.14090909090909093 (2.818 words correctly guessed)
	Δ(Accuracy): 0.34609090909090906 (6.922 drop of words correctly guessed, 0.692 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.05
	Accuracy': 0.0
	Δ(Accuracy): 0.05
D1: Depth of the tree.
	SDR: 0.22, Spearman: 0.3957351694679958
	SDR': 0.18181818181818182, Spearman': 0.39693122499466577
	Δ(SDR): 0.03818181818181818, Δ(Spearman): -0.001196055526669959




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.02888252337773641
	Min cosine similarity: 0.978466374103469
P1: Structural Probe.
	SDR: 0.505975, UUAS: 0.46871202916160387, Spearman: 0.6530553036747403
	SDR': 0.3675, UUAS': 0.22426595813522351, Spearman': 0.6514532507836592
	Δ(SDR): 0.13847499999999996, ΔUUAS: 0.24444607102638036, Δ(Spearman): 0.0016020528910810627
T1: POS-tag.
	Accuracy: 0.462 (9.240 words correctly guessed)
	Accuracy': 0.15252525252525254 (3.051 words correctly guessed)
	Δ(Accuracy): 0.30947474747474746 (6.189 drop of words correctly guessed, 6.189 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.4
	Accuracy': 0.050505050505050504
	Δ(Accuracy): 0.3494949494949495
D1: Depth of the tree.
	SDR: 0.22, Spearman: 0.4056504732214794
	SDR': 0.18181818181818182, Spearman': 0.3958035158740244
	Δ(SDR): 0.03818181818181818, Δ(Spearman): 0.009846957347454999




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.0419305811325709
	Min cosine similarity: 0.9592326656736508
P1: Structural Probe.
	SDR: 0.505975, UUAS: 0.46871202916160387, Spearman: 0.6530553036747403
	SDR': 0.35727272727272724, UUAS': 0.2066947833406929, Spearman': 0.6548256838402184
	Δ(SDR): 0.1487022727272727, ΔUUAS: 0.26201724582091096, Δ(Spearman): -0.001770380165478147
T1: POS-tag.
	Accuracy: 0.462 (9.240 words correctly guessed)
	Accuracy': 0.13434343434343438 (2.687 words correctly guessed)
	Δ(Accuracy): 0.32765656565656565 (6.553 drop of words correctly guessed, 1.311 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.4
	Accuracy': 0.020202020202020204
	Δ(Accuracy): 0.3797979797979798
D1: Depth of the tree.
	SDR: 0.22, Spearman: 0.4056504732214794
	SDR': 0.18181818181818182, Spearman': 0.4006762288728252
	Δ(SDR): 0.03818181818181818, Δ(Spearman): 0.004974244348654178




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.04931726555029551
	Min cosine similarity: 0.9441733233856432
P1: Structural Probe.
	SDR: 0.505975, UUAS: 0.46871202916160387, Spearman: 0.6530553036747403
	SDR': 0.3519696969696969, UUAS': 0.19793476716616784, Spearman': 0.6549799925018763
	Δ(SDR): 0.15400530303030308, ΔUUAS: 0.27077726199543606, Δ(Spearman): -0.001924688827136034
T1: POS-tag.
	Accuracy: 0.462 (9.240 words correctly guessed)
	Accuracy': 0.12929292929292932 (2.586 words correctly guessed)
	Δ(Accuracy): 0.33270707070707073 (6.654 drop of words correctly guessed, 0.665 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.4
	Accuracy': 0.020202020202020204
	Δ(Accuracy): 0.3797979797979798
D1: Depth of the tree.
	SDR: 0.22, Spearman: 0.4056504732214794
	SDR': 0.1717171717171717, Spearman': 0.395647959486981
	Δ(SDR): 0.04828282828282829, Δ(Spearman): 0.010002513734498397




