####################################################################################################
Seed: 42
model: fc, embeddings: glove
Layer P1: -1, layer T1: -1
Dataset(s): ['ud-english-lines'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 5,592,368
Trainable params: 5,592,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 600)                     307800      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 30)                  0           
================================================================================
Total params: 3,642,968
Trainable params: 3,642,968
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.02442171005588754
	Min cosine similarity: 0.9201084863445175
P1: Structural Probe.
	SDR: 0.7026857142857142, UUAS: 0.5591505791505792, Spearman: 0.8116949824315209
	SDR': 0.39406011450381684, UUAS': 0.1775175746710795, Spearman': 0.80897777741865
	Δ(SDR): 0.3086255997818974, ΔUUAS: 0.38163300447949966, Δ(Spearman): 0.0027172050128709824
T1: POS-tag.
	Accuracy: 0.6916190476190476 (13.832 words correctly guessed)
	Accuracy': 0.2239503816793893 (4.479 words correctly guessed)
	Δ(Accuracy): 0.4676686659396583 (9.353 drop of words correctly guessed, 9.353 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5657142857142857
	Accuracy': 0.06870229007633588
	Δ(Accuracy): 0.49701199563794984
D1: Depth of the tree.
	SDR: 0.4342857142857143, Spearman: 0.6890493602569543
	SDR': 0.1183206106870229, Spearman': 0.6877222867718793
	Δ(SDR): 0.31596510359869134, Δ(Spearman): 0.0013270734850749921




####################################################################################################
Seed: 42
model: fc, embeddings: glove
Layer P1: -1, layer T1: -1
Dataset(s): ['ud-english-lines'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 5,592,368
Trainable params: 5,592,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 600)                     307800      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 30)                  0           
================================================================================
Total params: 3,642,968
Trainable params: 3,642,968
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.035626480826956956
	Min cosine similarity: 0.8404088450380206
P1: Structural Probe.
	SDR: 0.7026857142857142, UUAS: 0.5591505791505792, Spearman: 0.8116949824315209
	SDR': 0.3801526717557252, UUAS': 0.15833444700215846, Spearman': 0.8025112418716046
	Δ(SDR): 0.32253304252998904, ΔUUAS: 0.4008161321484207, Δ(Spearman): 0.009183740559916331
T1: POS-tag.
	Accuracy: 0.6916190476190476 (13.832 words correctly guessed)
	Accuracy': 0.21316793893129768 (4.263 words correctly guessed)
	Δ(Accuracy): 0.47845110868774987 (9.569 drop of words correctly guessed, 1.914 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5657142857142857
	Accuracy': 0.05152671755725191
	Δ(Accuracy): 0.5141875681570338
D1: Depth of the tree.
	SDR: 0.4342857142857143, Spearman: 0.6890493602569543
	SDR': 0.08587786259541985, Spearman': 0.678142030943082
	Δ(SDR): 0.3484078516902944, Δ(Spearman): 0.010907329313872283




####################################################################################################
Seed: 42
model: fc, embeddings: glove
Layer P1: -1, layer T1: -1
Dataset(s): ['ud-english-lines'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 5,592,368
Trainable params: 5,592,368
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 600)                     307800      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 30)                  0           
================================================================================
Total params: 3,642,968
Trainable params: 3,642,968
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 3,345,428
Trainable params: 3,345,428
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.042828904333697855
	Min cosine similarity: 0.7818497168253055
P1: Structural Probe.
	SDR: 0.7026857142857142, UUAS: 0.5591505791505792, Spearman: 0.8116949824315209
	SDR': 0.37302003816793894, UUAS': 0.1569313767992735, Spearman': 0.7937154568414265
	Δ(SDR): 0.3296656761177753, ΔUUAS: 0.4022192023513057, Δ(Spearman): 0.017979525590094414
T1: POS-tag.
	Accuracy: 0.6916190476190476 (13.832 words correctly guessed)
	Accuracy': 0.208206106870229 (4.164 words correctly guessed)
	Δ(Accuracy): 0.4834129407488186 (9.668 drop of words correctly guessed, 0.967 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5657142857142857
	Accuracy': 0.04389312977099236
	Δ(Accuracy): 0.5218211559432934
D1: Depth of the tree.
	SDR: 0.4342857142857143, Spearman: 0.6890493602569543
	SDR': 0.08015267175572519, Spearman': 0.6696132916995533
	Δ(SDR): 0.3541330425299891, Δ(Spearman): 0.019436068557400987




