####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.036210002998510994
	Min cosine similarity: 0.949963588305194
P1: Structural Probe.
	SDR: 0.52325, UUAS: 0.5303766707168894, Spearman: 0.6875663222327838
	SDR': 0.35494949494949496, UUAS': 0.22883288617058206, Spearman': 0.686455051096621
	Δ(SDR): 0.16830050505050503, ΔUUAS: 0.30154378454630737, Δ(Spearman): 0.001111271136162828
T1: POS-tag.
	Accuracy: 0.4655 (9.310 words correctly guessed)
	Accuracy': 0.1414141414141414 (2.828 words correctly guessed)
	Δ(Accuracy): 0.3240858585858586 (6.482 drop of words correctly guessed, 6.482 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.51
	Accuracy': 0.06060606060606061
	Δ(Accuracy): 0.4493939393939394
D1: Depth of the tree.
	SDR: 0.23, Spearman: 0.42396334833928656
	SDR': 0.1717171717171717, Spearman': 0.4141865829312967
	Δ(SDR): 0.0582828282828283, Δ(Spearman): 0.009776765407989885




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.05466847121715546
	Min cosine similarity: 0.8914654266954672
P1: Structural Probe.
	SDR: 0.52325, UUAS: 0.5303766707168894, Spearman: 0.6875663222327838
	SDR': 0.3477272727272727, UUAS': 0.21335286204762707, Spearman': 0.685022047623435
	Δ(SDR): 0.17552272727272727, ΔUUAS: 0.3170238086692624, Δ(Spearman): 0.0025442746093488067
T1: POS-tag.
	Accuracy: 0.4655 (9.310 words correctly guessed)
	Accuracy': 0.1176767676767677 (2.354 words correctly guessed)
	Δ(Accuracy): 0.3478232323232323 (6.956 drop of words correctly guessed, 1.391 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.51
	Accuracy': 0.030303030303030304
	Δ(Accuracy): 0.47969696969696973
D1: Depth of the tree.
	SDR: 0.23, Spearman: 0.42396334833928656
	SDR': 0.1717171717171717, Spearman': 0.4156126828448427
	Δ(SDR): 0.0582828282828283, Δ(Spearman): 0.008350665494443854




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.06660125156243642
	Min cosine similarity: 0.8395780342997927
P1: Structural Probe.
	SDR: 0.52325, UUAS: 0.5303766707168894, Spearman: 0.6875663222327838
	SDR': 0.3435858585858586, UUAS': 0.20752180111934784, Spearman': 0.683092081950188
	Δ(SDR): 0.1796641414141414, ΔUUAS: 0.3228548695975416, Δ(Spearman): 0.004474240282595798
T1: POS-tag.
	Accuracy: 0.4655 (9.310 words correctly guessed)
	Accuracy': 0.11666666666666667 (2.333 words correctly guessed)
	Δ(Accuracy): 0.34883333333333333 (6.977 drop of words correctly guessed, 0.698 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.51
	Accuracy': 0.010101010101010102
	Δ(Accuracy): 0.4998989898989899
D1: Depth of the tree.
	SDR: 0.23, Spearman: 0.42396334833928656
	SDR': 0.1717171717171717, Spearman': 0.4170390185813097
	Δ(SDR): 0.0582828282828283, Δ(Spearman): 0.006924329757976855




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.03918487826983134
	Min cosine similarity: 0.9437314241823523
P1: Structural Probe.
	SDR: 0.5109, UUAS: 0.4781287970838396, Spearman: 0.672507707345121
	SDR': 0.35828282828282826, UUAS': 0.22959476217579702, Spearman': 0.6690619791898258
	Δ(SDR): 0.15261717171717176, ΔUUAS: 0.24853403490804257, Δ(Spearman): 0.0034457281552952024
T1: POS-tag.
	Accuracy: 0.42 (8.400 words correctly guessed)
	Accuracy': 0.15454545454545454 (3.091 words correctly guessed)
	Δ(Accuracy): 0.26545454545454544 (5.309 drop of words correctly guessed, 5.309 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.11
	Accuracy': 0.30303030303030304
	Δ(Accuracy): -0.19303030303030305
D1: Depth of the tree.
	SDR: 0.3, Spearman: nan
	SDR': 0.5050505050505051, Spearman': nan
	Δ(SDR): -0.2050505050505051, Δ(Spearman): nan




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.05865109463532766
	Min cosine similarity: 0.8803452247321003
P1: Structural Probe.
	SDR: 0.5109, UUAS: 0.4781287970838396, Spearman: 0.672507707345121
	SDR': 0.3478535353535354, UUAS': 0.21002645471404272, Spearman': 0.663302167177714
	Δ(SDR): 0.1630464646464646, ΔUUAS: 0.2681023423697969, Δ(Spearman): 0.009205540167407045
T1: POS-tag.
	Accuracy: 0.42 (8.400 words correctly guessed)
	Accuracy': 0.12878787878787878 (2.576 words correctly guessed)
	Δ(Accuracy): 0.2912121212121212 (5.824 drop of words correctly guessed, 1.165 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.11
	Accuracy': 0.29292929292929293
	Δ(Accuracy): -0.18292929292929294
D1: Depth of the tree.
	SDR: 0.3, Spearman: nan
	SDR': 0.5050505050505051, Spearman': nan
	Δ(SDR): -0.2050505050505051, Δ(Spearman): nan




####################################################################################################
Seed: 42
model: fc, embeddings: bert
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-pud'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4400)                    2257200     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 11)                 0           
================================================================================
Total params: 10,384,688
Trainable params: 10,384,688
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.06984960536162059
	Min cosine similarity: 0.8324942179400512
P1: Structural Probe.
	SDR: 0.5109, UUAS: 0.4781287970838396, Spearman: 0.672507707345121
	SDR': 0.34545454545454546, UUAS': 0.2025989468907426, Spearman': 0.6584416092734433
	Δ(SDR): 0.16544545454545456, ΔUUAS: 0.275529850193097, Δ(Spearman): 0.01406609807167769
T1: POS-tag.
	Accuracy: 0.42 (8.400 words correctly guessed)
	Accuracy': 0.12222222222222222 (2.444 words correctly guessed)
	Δ(Accuracy): 0.29777777777777775 (5.956 drop of words correctly guessed, 0.596 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.11
	Accuracy': 0.29292929292929293
	Δ(Accuracy): -0.18292929292929294
D1: Depth of the tree.
	SDR: 0.3, Spearman: nan
	SDR': 0.5050505050505051, Spearman': nan
	Δ(SDR): -0.2050505050505051, Δ(Spearman): nan




