####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 10,589,888
Trainable params: 10,589,888
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.023481922845045727
	Min cosine similarity: 0.9799443176054019
P1: Structural Probe.
	SDR: 0.7138986486486486, UUAS: 0.6087658592848905, Spearman: 0.807051794765971
	SDR': 0.46345737483085253, UUAS': 0.1670826686926334, Spearman': 0.8066669310372485
	Δ(SDR): 0.2504412738177961, ΔUUAS: 0.441683190592257, Δ(Spearman): 0.0003848637287224843
T1: POS-tag.
	Accuracy: 0.7283783783783784 (14.568 words correctly guessed)
	Accuracy': 0.4436400541271989 (8.873 words correctly guessed)
	Δ(Accuracy): 0.28473832425117945 (5.695 drop of words correctly guessed, 5.695 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5351351351351351
	Accuracy': 0.07577807848443843
	Δ(Accuracy): 0.4593570566506967
D1: Depth of the tree.
	SDR: 0.46216216216216216, Spearman: 0.678467627095462
	SDR': 0.12313937753721245, Spearman': 0.678311385772035
	Δ(SDR): 0.3390227846249497, Δ(Spearman): 0.00015624132342706432




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 10,589,888
Trainable params: 10,589,888
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.032984202106793724
	Min cosine similarity: 0.9629523573450856
P1: Structural Probe.
	SDR: 0.7138986486486486, UUAS: 0.6087658592848905, Spearman: 0.807051794765971
	SDR': 0.45498646820027067, UUAS': 0.15196936277820203, Spearman': 0.8044731301532348
	Δ(SDR): 0.25891218044837794, ΔUUAS: 0.4567964965066884, Δ(Spearman): 0.002578664612736148
T1: POS-tag.
	Accuracy: 0.7283783783783784 (14.568 words correctly guessed)
	Accuracy': 0.42692828146143436 (8.539 words correctly guessed)
	Δ(Accuracy): 0.301450096916944 (6.029 drop of words correctly guessed, 1.206 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5351351351351351
	Accuracy': 0.05142083897158322
	Δ(Accuracy): 0.4837142961635519
D1: Depth of the tree.
	SDR: 0.46216216216216216, Spearman: 0.678467627095462
	SDR': 0.09878213802435724, Spearman': 0.6739701860789752
	Δ(SDR): 0.3633800241378049, Δ(Spearman): 0.004497441016486858




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -9, layer T1: -9
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 10,589,888
Trainable params: 10,589,888
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.038483940064907074
	Min cosine similarity: 0.9499579429303842
P1: Structural Probe.
	SDR: 0.7138986486486486, UUAS: 0.6087658592848905, Spearman: 0.807051794765971
	SDR': 0.4509438430311231, UUAS': 0.14523710740548929, Spearman': 0.8004200658519164
	Δ(SDR): 0.2629548056175255, ΔUUAS: 0.4635287518794012, Δ(Spearman): 0.006631728914054613
T1: POS-tag.
	Accuracy: 0.7283783783783784 (14.568 words correctly guessed)
	Accuracy': 0.4181326116373478 (8.363 words correctly guessed)
	Δ(Accuracy): 0.3102457667410306 (6.205 drop of words correctly guessed, 0.620 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5351351351351351
	Accuracy': 0.056833558863328824
	Δ(Accuracy): 0.4783015762718063
D1: Depth of the tree.
	SDR: 0.46216216216216216, Spearman: 0.678467627095462
	SDR': 0.08525033829499323, Spearman': 0.670784227067734
	Δ(SDR): 0.3769118238671689, Δ(Spearman): 0.007683400027728049




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 10,589,888
Trainable params: 10,589,888
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 1, budget per-sentence: 10
	Max L_2-norm: 0.034068986773490906
	Min cosine similarity: 0.9663911789292734
P1: Structural Probe.
	SDR: 0.7156722972972973, UUAS: 0.6031141868512111, Spearman: 0.8165041579254206
	SDR': 0.460723951285521, UUAS': 0.15850361170720245, Spearman': 0.8153869024690208
	Δ(SDR): 0.2549483460117763, ΔUUAS: 0.44461057514400865, Δ(Spearman): 0.001117255456399846
T1: POS-tag.
	Accuracy: 0.7173648648648648 (14.347 words correctly guessed)
	Accuracy': 0.44479025710419484 (8.896 words correctly guessed)
	Δ(Accuracy): 0.27257460776067 (5.451 drop of words correctly guessed, 5.451 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5324324324324324
	Accuracy': 0.07171853856562922
	Δ(Accuracy): 0.4607138938668032
D1: Depth of the tree.
	SDR: 0.42702702702702705, Spearman: 0.6724859108079031
	SDR': 0.09878213802435724, Spearman': 0.6775494431954423
	Δ(SDR): 0.3282448890026698, Δ(Spearman): -0.005063532387539205




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 10,589,888
Trainable params: 10,589,888
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 5, budget per-sentence: 10
	Max L_2-norm: 0.04575043419996897
	Min cosine similarity: 0.9454512959888082
P1: Structural Probe.
	SDR: 0.7156722972972973, UUAS: 0.6031141868512111, Spearman: 0.8165041579254206
	SDR': 0.4526082543978349, UUAS': 0.14220380759609885, Spearman': 0.8131775590414024
	Δ(SDR): 0.2630640428994624, ΔUUAS: 0.46091037925511225, Δ(Spearman): 0.003326598884018206
T1: POS-tag.
	Accuracy: 0.7173648648648648 (14.347 words correctly guessed)
	Accuracy': 0.4273342354533153 (8.547 words correctly guessed)
	Δ(Accuracy): 0.29003062941154956 (5.801 drop of words correctly guessed, 1.160 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5324324324324324
	Accuracy': 0.05277401894451962
	Δ(Accuracy): 0.4796584134879128
D1: Depth of the tree.
	SDR: 0.42702702702702705, Spearman: 0.6724859108079031
	SDR': 0.08254397834912043, Spearman': 0.6776543016438662
	Δ(SDR): 0.34448304867790663, Δ(Spearman): -0.005168390835963099




####################################################################################################
Seed: 42
model: fc, embeddings: roberta
Layer P1: -5, layer T1: -5
Dataset(s): ['ud-english-gum'], input-length: 20, keep_pos_ratio: 0.2
Classification_p1: True, classification_t1: True, classification_r1: true
Training epochs: P1: 50, T1: 50, R1: 50
P1 MODEL
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dropout (Dropout)                   (None, 512)                     0           
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_1 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_2 (Dense)                     (None, 4800)                    2462400     
________________________________________________________________________________
reshape (Reshape)                   (None, 400, 12)                 0           
================================================================================
Total params: 10,589,888
Trainable params: 10,589,888
Non-trainable params: 0
________________________________________________________________________________
T1 MODEL
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_3 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_2 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_4 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_3 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_5 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 8,230,088
Trainable params: 8,230,088
Non-trainable params: 0
________________________________________________________________________________
R1 MODEL
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_6 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_4 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dropout_5 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_8 (Dense)                     (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
D1 MODEL
Model: "sequential_3"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_9 (Dense)                     (None, 512)                     7864832     
________________________________________________________________________________
dropout_6 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_10 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dropout_7 (Dropout)                 (None, 512)                     0           
________________________________________________________________________________
dense_11 (Dense)                    (None, 20)                      10260       
================================================================================
Total params: 8,137,748
Trainable params: 8,137,748
Non-trainable params: 0
________________________________________________________________________________
Activation P1: linear, P1: linear, R1: linear, D1: linear

Perturbations method: WordNet-coPOS.
WordNet selection via: minority vote (least frequent).
Perturbations scenario: worst.
Perturbations budget: 10, budget per-sentence: 10
	Max L_2-norm: 0.0515021284421285
	Min cosine similarity: 0.9324456517848013
P1: Structural Probe.
	SDR: 0.7156722972972973, UUAS: 0.6031141868512111, Spearman: 0.8165041579254206
	SDR': 0.4483626522327469, UUAS': 0.13759581073256988, Spearman': 0.8089966382576963
	Δ(SDR): 0.2673096450645504, ΔUUAS: 0.4655183761186412, Δ(Spearman): 0.007507519667724338
T1: POS-tag.
	Accuracy: 0.7173648648648648 (14.347 words correctly guessed)
	Accuracy': 0.4200270635994587 (8.401 words correctly guessed)
	Δ(Accuracy): 0.29733780126540615 (5.947 drop of words correctly guessed, 0.595 drop of words correctly guessed per unit of budget)
R1: Root identification.
	Accuracy: 0.5324324324324324
	Accuracy': 0.05548037889039242
	Δ(Accuracy): 0.47695205354204
D1: Depth of the tree.
	SDR: 0.42702702702702705, Spearman: 0.6724859108079031
	SDR': 0.05953991880920163, Spearman': 0.6655504206033844
	Δ(SDR): 0.36748710821782543, Δ(Spearman): 0.006935490204518668




