####################################################################################################
model: fc, embeddings: bert (layer -2)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.835235825388861
loss: 0.6126185655593872 - mae: 0.4239019751548767 - mse: 0.21891503036022186 - cross_entropy: 0.6126187443733215

####################################################################################################
model: fc, embeddings: bert (layer -2)
dataset(s): ['en-universal'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 460)                     235980      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 23)                  0           
================================================================================
Total params: 8,888,780
Trainable params: 8,888,780
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6528976417461114
loss: 0.6671038269996643 - mae: 0.47494399547576904 - mse: 0.23993925750255585 - cross_entropy: 0.6671041250228882

####################################################################################################
model: fc, embeddings: bert (layer -7)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.8704340190667336
loss: 0.6094951033592224 - mae: 0.41877371072769165 - mse: 0.2182154804468155 - cross_entropy: 0.609495222568512

####################################################################################################
model: fc, embeddings: bert (layer -9)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.8849096838936277
loss: 0.605475902557373 - mae: 0.4173497259616852 - mse: 0.2169564664363861 - cross_entropy: 0.605475902557373

####################################################################################################
model: fc, embeddings: bert (layer -7)
dataset(s): ['en-universal'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 460)                     235980      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 23)                  0           
================================================================================
Total params: 8,888,780
Trainable params: 8,888,780
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6739337681886604
loss: 0.6663784384727478 - mae: 0.4738117456436157 - mse: 0.23970109224319458 - cross_entropy: 0.6663786172866821

####################################################################################################
model: fc, embeddings: bert (layer -9)
dataset(s): ['en-universal'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 460)                     235980      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 23)                  0           
================================================================================
Total params: 8,888,780
Trainable params: 8,888,780
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.681472654290015
loss: 0.6652061939239502 - mae: 0.47366324067115784 - mse: 0.23942436277866364 - cross_entropy: 0.6652061343193054

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -5)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.31453838434520826
loss: 7.479226589202881 - mae: 0.48994722962379456 - mse: 0.48994722962379456 - cross_entropy: 7.4792256355285645

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -7)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.3788384345208229
loss: 7.275906085968018 - mae: 0.4768308103084564 - mse: 0.47681131958961487 - cross_entropy: 7.27590799331665

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -9)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.8972654290015053
loss: 0.6032331585884094 - mae: 0.4158580005168915 - mse: 0.21651051938533783 - cross_entropy: 0.6032331585884094

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -9)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.8591570496738585
loss: 0.6194211840629578 - mae: 0.4171840250492096 - mse: 0.21869248151779175 - cross_entropy: 0.619421124458313

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -9)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.8972654290015053
loss: 0.6032331585884094 - mae: 0.4158580005168915 - mse: 0.21651051938533783 - cross_entropy: 0.6032331585884094

