####################################################################################################
model: fc, embeddings: glove (layer -2)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 3,963,080
Trainable params: 3,963,080
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.8556949322629203
loss: 0.6224770545959473 - mae: 0.4165651500225067 - mse: 0.22037553787231445 - cross_entropy: 0.6224771738052368

####################################################################################################
model: fc, embeddings: glove (layer -2)
dataset(s): ['en-universal'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 460)                     235980      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 23)                  0           
================================================================================
Total params: 4,096,460
Trainable params: 4,096,460
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.7808454591068741
loss: 0.6647809743881226 - mae: 0.46772119402885437 - mse: 0.2388213723897934 - cross_entropy: 0.6647810339927673

