####################################################################################################
Seed: 1
model: fc, embeddings: word2vec (layer -1)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 3,963,080
Trainable params: 3,963,080
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.7941796287004516
loss: 0.6207149624824524 - mae: 0.432666152715683 - mse: 0.22089684009552002 - cross_entropy: 0.6207149028778076

####################################################################################################
Seed: 1
model: fc, embeddings: word2vec (layer -1)
dataset(s): ['en-universal'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 3,963,080
Trainable params: 3,963,080
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.7965002508780733
loss: 0.6205282807350159 - mae: 0.4315084218978882 - mse: 0.22093580663204193 - cross_entropy: 0.6205283999443054

