####################################################################################################
model: fc, embeddings: glove-counterfitted (layer -1)
dataset(s): ['ted'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 9)                   0           
================================================================================
Total params: 3,952,820
Trainable params: 3,952,820
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6077868852459016
loss: 0.6580840945243835 - mae: 0.43835729360580444 - mse: 0.23197785019874573 - cross_entropy: 0.6580841541290283

####################################################################################################
model: fc, embeddings: glove-counterfitted (layer -1)
dataset(s): ['ted'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 9)                   0           
================================================================================
Total params: 3,952,820
Trainable params: 3,952,820
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6368852459016393
loss: 0.7124516367912292 - mae: 0.426142156124115 - mse: 0.24496234953403473 - cross_entropy: 0.712451696395874

