####################################################################################################
model: fc, embeddings: roberta (layer -2)
dataset(s): ['ted'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 9)                   0           
================================================================================
Total params: 8,745,140
Trainable params: 8,745,140
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6819672131147541
loss: 0.6355858445167542 - mae: 0.4336353838443756 - mse: 0.22560591995716095 - cross_entropy: 0.6355857849121094

####################################################################################################
model: fc, embeddings: roberta (layer -2)
dataset(s): ['ted'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 440)                     225720      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 22)                  0           
================================================================================
Total params: 8,878,520
Trainable params: 8,878,520
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.5524590163934426
loss: 0.6714258790016174 - mae: 0.48011645674705505 - mse: 0.24160194396972656 - cross_entropy: 0.6714259386062622

####################################################################################################
model: fc, embeddings: roberta (layer -7)
dataset(s): ['ted'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 9)                   0           
================================================================================
Total params: 8,745,140
Trainable params: 8,745,140
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6762295081967213
loss: 0.6308242082595825 - mae: 0.4355919063091278 - mse: 0.22457602620124817 - cross_entropy: 0.6308242082595825

####################################################################################################
model: fc, embeddings: roberta (layer -5)
dataset(s): ['ted'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 440)                     225720      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 22)                  0           
================================================================================
Total params: 8,878,520
Trainable params: 8,878,520
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.5426229508196722
loss: 0.6713114380836487 - mae: 0.4809902608394623 - mse: 0.24158543348312378 - cross_entropy: 0.6713114380836487

####################################################################################################
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ted'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 9)                   0           
================================================================================
Total params: 8,745,140
Trainable params: 8,745,140
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6762295081967213
loss: 0.6337347626686096 - mae: 0.4334188401699066 - mse: 0.22524109482765198 - cross_entropy: 0.6337347626686096

####################################################################################################
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ted'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 440)                     225720      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 22)                  0           
================================================================================
Total params: 8,878,520
Trainable params: 8,878,520
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.5487704918032786
loss: 0.6713285446166992 - mae: 0.47997891902923584 - mse: 0.24170339107513428 - cross_entropy: 0.6713285446166992

####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -5)
dataset(s): ['ted'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 9)                   0           
================================================================================
Total params: 8,745,140
Trainable params: 8,745,140
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.27827868852459015
loss: 6.109324932098389 - mae: 0.4814513623714447 - mse: 0.46988746523857117 - cross_entropy: 6.109324932098389

####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -5)
dataset(s): ['ted'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 9)                   0           
================================================================================
Total params: 8,745,140
Trainable params: 8,745,140
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.27827868852459015
loss: 6.109324932098389 - mae: 0.4814513623714447 - mse: 0.46988746523857117 - cross_entropy: 6.109324932098389

####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ted'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 9)                   0           
================================================================================
Total params: 8,745,140
Trainable params: 8,745,140
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.7512295081967213
loss: 0.6661614179611206 - mae: 0.4163859784603119 - mse: 0.2344771772623062 - cross_entropy: 0.6661614775657654

