####################################################################################################
model: fc, embeddings: glove (layer -2)
dataset(s): ['ted'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 180)                     92340       
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 9)                   0           
================================================================================
Total params: 3,952,820
Trainable params: 3,952,820
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6766393442622951
loss: 0.6495919227600098 - mae: 0.4286499619483948 - mse: 0.2301063984632492 - cross_entropy: 0.6495919823646545

####################################################################################################
model: fc, embeddings: glove (layer -2)
dataset(s): ['ted'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 440)                     225720      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 22)                  0           
================================================================================
Total params: 4,086,200
Trainable params: 4,086,200
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.580327868852459
loss: 0.6752363443374634 - mae: 0.4762226641178131 - mse: 0.24351170659065247 - cross_entropy: 0.6752364039421082

