####################################################################################################
Seed: 1
model: fc, embeddings: glove-counterfitted (layer -1)
dataset(s): ['ud-english-gum'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 460)                     235980      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 23)                  0           
================================================================================
Total params: 4,096,460
Trainable params: 4,096,460
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.5843243243243244
loss: 0.7075725793838501 - mae: 0.4736466705799103 - mse: 0.25283491611480713 - cross_entropy: 0.7075726985931396

####################################################################################################
Seed: 1
model: fc, embeddings: glove-counterfitted (layer -1)
dataset(s): ['ud-english-gum'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential_2"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_10 (Dense)                    (None, 512)                     3072512     
________________________________________________________________________________
dense_11 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dense_12 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dense_13 (Dense)                    (None, 512)                     262656      
________________________________________________________________________________
dense_14 (Dense)                    (None, 200)                     102600      
________________________________________________________________________________
reshape_2 (Reshape)                 (None, 20, 10)                  0           
================================================================================
Total params: 3,963,080
Trainable params: 3,963,080
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6952702702702702
loss: 0.7255356907844543 - mae: 0.4277842342853546 - mse: 0.24767373502254486 - cross_entropy: 0.7255356311798096

