####################################################################################################
model: fc, embeddings: glove (layer -2)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 3,963,080
Trainable params: 3,963,080
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.5135
loss: 0.7018989324569702 - mae: 0.45122072100639343 - mse: 0.24703310430049896 - cross_entropy: 0.7018989324569702

####################################################################################################
model: fc, embeddings: glove (layer -2)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 480)                     246240      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 24)                  0           
================================================================================
Total params: 4,106,720
Trainable params: 4,106,720
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.4365
loss: 0.6914879679679871 - mae: 0.4836514890193939 - mse: 0.24915364384651184 - cross_entropy: 0.6914879679679871

