####################################################################################################
model: fc, embeddings: roberta (layer -2)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.5195
loss: 0.6675715446472168 - mae: 0.46012967824935913 - mse: 0.23808616399765015 - cross_entropy: 0.6675715446472168

####################################################################################################
model: fc, embeddings: roberta (layer -2)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 480)                     246240      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 24)                  0           
================================================================================
Total params: 8,899,040
Trainable params: 8,899,040
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.4445
loss: 0.6825969219207764 - mae: 0.48819050192832947 - mse: 0.24560679495334625 - cross_entropy: 0.6825968027114868

####################################################################################################
model: fc, embeddings: roberta (layer -7)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.4835
loss: 0.6687621474266052 - mae: 0.46438178420066833 - mse: 0.23905552923679352 - cross_entropy: 0.6687620878219604

####################################################################################################
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.508
loss: 0.6641203165054321 - mae: 0.46159330010414124 - mse: 0.23694176971912384 - cross_entropy: 0.6641203761100769

####################################################################################################
model: fc, embeddings: roberta (layer -7)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 480)                     246240      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 24)                  0           
================================================================================
Total params: 8,899,040
Trainable params: 8,899,040
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.437
loss: 0.6825247406959534 - mae: 0.4885852336883545 - mse: 0.2456098347902298 - cross_entropy: 0.6825248003005981

####################################################################################################
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 480)                     246240      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 24)                  0           
================================================================================
Total params: 8,899,040
Trainable params: 8,899,040
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.429
loss: 0.6822450757026672 - mae: 0.48859336972236633 - mse: 0.24544769525527954 - cross_entropy: 0.6822450757026672

####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -5)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.1725
loss: 5.386712551116943 - mae: 0.4943787753582001 - mse: 0.4731951653957367 - cross_entropy: 5.386712551116943

####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.589
loss: 0.7159832715988159 - mae: 0.4397694766521454 - mse: 0.25281569361686707 - cross_entropy: 0.7159832715988159

