####################################################################################################
Seed: 1
model: fc, embeddings: word2vec (layer -1)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 3,963,080
Trainable params: 3,963,080
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.553
loss: 0.7546684741973877 - mae: 0.44068843126296997 - mse: 0.2581409215927124 - cross_entropy: 0.7546685338020325

####################################################################################################
Seed: 1
model: fc, embeddings: word2vec (layer -1)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 3,963,080
Trainable params: 3,963,080
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.5585
loss: 0.7927498817443848 - mae: 0.43730175495147705 - mse: 0.2685058116912842 - cross_entropy: 0.7927498817443848

