####################################################################################################
model: fc, embeddings: bert (layer -2)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.448
loss: 0.6793888807296753 - mae: 0.46649909019470215 - mse: 0.2427385449409485 - cross_entropy: 0.6793888807296753

####################################################################################################
model: fc, embeddings: bert (layer -2)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 480)                     246240      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 24)                  0           
================================================================================
Total params: 8,899,040
Trainable params: 8,899,040
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.4015
loss: 0.6836382150650024 - mae: 0.4896667003631592 - mse: 0.24603083729743958 - cross_entropy: 0.683638334274292

####################################################################################################
model: fc, embeddings: bert (layer -7)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.526
loss: 0.6672595143318176 - mae: 0.45810458064079285 - mse: 0.23779846727848053 - cross_entropy: 0.6672595739364624

####################################################################################################
model: fc, embeddings: bert (layer -9)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.5565
loss: 0.6667747497558594 - mae: 0.45362940430641174 - mse: 0.2369866967201233 - cross_entropy: 0.6667746305465698

####################################################################################################
model: fc, embeddings: bert (layer -7)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 480)                     246240      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 24)                  0           
================================================================================
Total params: 8,899,040
Trainable params: 8,899,040
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.436
loss: 0.6822823286056519 - mae: 0.48809167742729187 - mse: 0.24547179043293 - cross_entropy: 0.6822823882102966

####################################################################################################
model: fc, embeddings: bert (layer -9)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 480)                     246240      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 24)                  0           
================================================================================
Total params: 8,899,040
Trainable params: 8,899,040
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.4645
loss: 0.6819992661476135 - mae: 0.4869067072868347 - mse: 0.24537070095539093 - cross_entropy: 0.6819992065429688

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -5)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.1525
loss: 5.668566703796387 - mae: 0.49478957056999207 - mse: 0.4769948720932007 - cross_entropy: 5.668567180633545

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -7)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.129
loss: 5.688077926635742 - mae: 0.5023357272148132 - mse: 0.4853816628456116 - cross_entropy: 5.688077926635742

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -9)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.644
loss: 0.7129132151603699 - mae: 0.4322510361671448 - mse: 0.25128939747810364 - cross_entropy: 0.7129132747650146

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -9)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.592
loss: 0.7235984206199646 - mae: 0.4370824694633484 - mse: 0.2510395348072052 - cross_entropy: 0.7235983610153198

####################################################################################################
Seed: 1
model: fc, embeddings: bert (layer -9)
dataset(s): ['ud-english-pud'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.644
loss: 0.7129132151603699 - mae: 0.4322510361671448 - mse: 0.25128939747810364 - cross_entropy: 0.7129132747650146

