####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ud-english-ewt'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 11)                  0           
================================================================================
Total params: 8,765,660
Trainable params: 8,765,660
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.9486734693877551
loss: 0.5976302623748779 - mae: 0.4239277243614197 - mse: 0.21443909406661987 - cross_entropy: 0.5976303219795227

####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -5)
dataset(s): ['ud-english-ewt'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 11)                  0           
================================================================================
Total params: 8,765,660
Trainable params: 8,765,660
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.9896938775510205
loss: 0.5744425058364868 - mae: 0.41269010305404663 - mse: 0.20679959654808044 - cross_entropy: 0.5744425058364868

####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ud-english-ewt'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 11)                  0           
================================================================================
Total params: 8,765,660
Trainable params: 8,765,660
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.9905102040816327
loss: 0.5756283402442932 - mae: 0.4126659631729126 - mse: 0.20735982060432434 - cross_entropy: 0.575628399848938

