####################################################################################################
model: fc, embeddings: glove (layer -2)
dataset(s): ['ud-english-lines'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 600)                     307800      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 30)                  0           
================================================================================
Total params: 4,168,280
Trainable params: 4,168,280
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.6825714285714286
loss: 0.6777323484420776 - mae: 0.47762709856033325 - mse: 0.2440088391304016 - cross_entropy: 0.6777322292327881

####################################################################################################
model: fc, embeddings: glove (layer -2)
dataset(s): ['ud-english-lines'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 1480)                    759240      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 74)                  0           
================================================================================
Total params: 4,619,720
Trainable params: 4,619,720
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.669047619047619
loss: 0.685767412185669 - mae: 0.4912855625152588 - mse: 0.24724720418453217 - cross_entropy: 0.685767412185669

