####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ud-english-gum'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.7946621621621621
loss: 0.6259729862213135 - mae: 0.42473772168159485 - mse: 0.22400744259357452 - cross_entropy: 0.6259729266166687

####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -5)
dataset(s): ['ud-english-gum'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.7973648648648649
loss: 0.6467671394348145 - mae: 0.4214912950992584 - mse: 0.22945339977741241 - cross_entropy: 0.646767258644104

####################################################################################################
Seed: 1
model: fc, embeddings: roberta (layer -9)
dataset(s): ['ud-english-gum'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     7864832     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 8,755,400
Trainable params: 8,755,400
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.7972972972972973
loss: 0.646510124206543 - mae: 0.42067742347717285 - mse: 0.22875458002090454 - cross_entropy: 0.646510124206543

