####################################################################################################
Seed: 1
model: fc, embeddings: glove-counterfitted (layer -1)
dataset(s): ['ud-english-ewt'], keep_pos_ratio: 0.5, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 520)                     266760      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 26)                  0           
================================================================================
Total params: 4,127,240
Trainable params: 4,127,240
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.98
loss: 0.6464977264404297 - mae: 0.464834988117218 - mse: 0.23279045522212982 - cross_entropy: 0.6464977264404297

####################################################################################################
Seed: 1
model: fc, embeddings: glove-counterfitted (layer -1)
dataset(s): ['ud-english-ewt'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential_1"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense_5 (Dense)                     (None, 512)                     3072512     
________________________________________________________________________________
dense_6 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_7 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_8 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_9 (Dense)                     (None, 220)                     112860      
________________________________________________________________________________
reshape_1 (Reshape)                 (None, 20, 11)                  0           
================================================================================
Total params: 3,973,340
Trainable params: 3,973,340
Non-trainable params: 0
________________________________________________________________________________
Activations: relu
Accuracy: 0.9836734693877551
loss: 0.572553813457489 - mae: 0.4116724729537964 - mse: 0.20627625286579132 - cross_entropy: 0.5725536942481995

