####################################################################################################
Seed: 1
model: fc, embeddings: glove (layer -1)
dataset(s): ['ud-english-gum'], keep_pos_ratio: 0.2, input-length: 20, classification: True
Model: "sequential"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
dense (Dense)                       (None, 512)                     3072512     
________________________________________________________________________________
dense_1 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_2 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_3 (Dense)                     (None, 512)                     262656      
________________________________________________________________________________
dense_4 (Dense)                     (None, 200)                     102600      
________________________________________________________________________________
reshape (Reshape)                   (None, 20, 10)                  0           
================================================================================
Total params: 3,963,080
Trainable params: 3,963,080
Non-trainable params: 0
________________________________________________________________________________
Activations: linear
Accuracy: 0.750472972972973
loss: 0.6940225958824158 - mae: 0.4220679700374603 - mse: 0.23915500938892365 - cross_entropy: 0.6940226554870605

